
//////////////////////////////////////////////////////////
/*
    Создание файла, отображаемого в памяти
*/
void OpenFileMap( void );

//////////////////////////////////////////////////////////
/*
   // Закрытие карты памяти
*/

void CloseFileMap( void );


//////////////////////////////////////////////////////////
/*
        // Инициализация платы и запуск сигнальных процессоров на выполнение
*/
int Ini_Start(char *file);

//////////////////////////////////////////////////////////
/*
        // Чтение файла, содержащего программу ДДС
*/
int  ReadPrgFile( char *fileName, U32 *dst, S32 size );

//////////////////////////////////////////////////////////
/*
        // Загрузка параметров
*/
//---------------------------------------------------------------------------
int sagr(void);
//////////////////////////////////////////////////////////
/*
   передача параметров на плату ЦОС 
*/
//---------------------------------------------------------------------------

void stop();

void exit();

void copy_struct();

int komandos(int kom_da); // функция передачи команды в процессор

void perevod_ed(); // функция пересчета для имитации
